; domain
; source: https://github.com/AI-Planning/pddl-generators/blob/main/transport/domain.pddl
; updates:
;  - removed :action-costs and :functions
;  - capacity type now is size
;  - capacity-number predicate now is capacity
;  - remove the road predicate to allow fully connected graph
(define (domain transport)
  (:requirements :typing)
  (:types
        size location locatable - object
        vehicle package - locatable
  )

  (:predicates
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - size)
     (capacity-predecessor ?s1 ?s2 - size)
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (not (at ?v ?l2))
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - size)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - size)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
      )
  )

)

; problem
;; vehicles=5, packages=14, locations=14, density=1.0, fully_connected=True, max_capacity=2, out_folder=./fully/training, instance_id=30, seed=71

(define (problem transport-30)
 (:domain transport)
 (:objects 
    v1 v2 v3 v4 v5 - vehicle
    p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 - package
    l1 l2 l3 l4 l5 l6 l7 l8 l9 l10 l11 l12 l13 l14 - location
    c0 c1 c2 - size
    )
 (:init (capacity v1 c2)
    (capacity v2 c1)
    (capacity v3 c2)
    (capacity v4 c1)
    (capacity v5 c1)
    (capacity-predecessor c0 c1)
    (capacity-predecessor c1 c2)
    (at p1 l5)
    (at p2 l2)
    (at p3 l4)
    (at p4 l9)
    (at p5 l1)
    (at p6 l10)
    (at p7 l4)
    (at p8 l9)
    (at p9 l1)
    (at p10 l14)
    (at p11 l12)
    (at p12 l9)
    (at p13 l6)
    (at p14 l14)
    (at v1 l8)
    (at v2 l13)
    (at v3 l3)
    (at v4 l6)
    (at v5 l11)
    )
 (:goal  (and 
    (at p1 l3)
    (at p2 l1)
    (at p3 l6)
    (at p4 l10)
    (at p5 l7)
    (at p6 l11)
    (at p7 l10)
    (at p8 l4)
    (at p9 l3)
    (at p10 l6)
    (at p11 l14)
    (at p12 l7)
    (at p13 l8)
    (at p14 l2))))

; plan
1. (pick-up v4 l6 p13 c0 c1)
   deleted: (at p13 l6) (capacity v4 c1)
   added: (in p13 v4) (capacity v4 c0)
   goals met: 0 of 14
2. (drive v4 l6 l8)
   deleted: (at v4 l6)
   added: (at v4 l8)
   goals met: 0 of 14
3. (drop v4 l8 p13 c0 c1)
   deleted: (in p13 v4) (capacity v4 c0)
   added: (at p13 l8) (capacity v4 c1)
   goals met: 1 of 14
4. (drive v2 l13 l1)
   deleted: (at v2 l13)
   added: (at v2 l1)
   goals met: 1 of 14
5. (drive v5 l11 l10)
   deleted: (at v5 l11)
   added: (at v5 l10)
   goals met: 1 of 14
6. (pick-up v5 l10 p6 c0 c1)
   deleted: (at p6 l10) (capacity v5 c1)
   added: (in p6 v5) (capacity v5 c0)
   goals met: 1 of 14
7. (drive v5 l10 l11)
   deleted: (at v5 l10)
   added: (at v5 l11)
   goals met: 1 of 14
8. (drop v5 l11 p6 c0 c1)
   deleted: (in p6 v5) (capacity v5 c0)
   added: (at p6 l11) (capacity v5 c1)
   goals met: 2 of 14
9. (drive v2 l1 l12)
   deleted: (at v2 l1)
   added: (at v2 l12)
   goals met: 2 of 14
10. (pick-up v2 l12 p11 c0 c1)
   deleted: (at p11 l12) (capacity v2 c1)
   added: (in p11 v2) (capacity v2 c0)
   goals met: 2 of 14
11. (drive v4 l8 l1)
   deleted: (at v4 l8)
   added: (at v4 l1)
   goals met: 2 of 14
12. (drive v4 l1 l14)
   deleted: (at v4 l1)
   added: (at v4 l14)
   goals met: 2 of 14
13. (drive v2 l12 l14)
   deleted: (at v2 l12)
   added: (at v2 l14)
   goals met: 2 of 14
14. (drop v2 l14 p11 c0 c1)
   deleted: (in p11 v2) (capacity v2 c0)
   added: (at p11 l14) (capacity v2 c1)
   goals met: 3 of 14
15. (drive v4 l14 l2)
   deleted: (at v4 l14)
   added: (at v4 l2)
   goals met: 3 of 14
16. (pick-up v4 l2 p2 c0 c1)
   deleted: (at p2 l2) (capacity v4 c1)
   added: (in p2 v4) (capacity v4 c0)
   goals met: 3 of 14
17. (drive v4 l2 l1)
   deleted: (at v4 l2)
   added: (at v4 l1)
   goals met: 3 of 14
18. (drop v4 l1 p2 c0 c1)
   deleted: (in p2 v4) (capacity v4 c0)
   added: (at p2 l1) (capacity v4 c1)
   goals met: 4 of 14
19. (drive v4 l1 l3)
   deleted: (at v4 l1)
   added: (at v4 l3)
   goals met: 4 of 14
20. (drive v4 l3 l5)
   deleted: (at v4 l3)
   added: (at v4 l5)
   goals met: 4 of 14
21. (pick-up v4 l5 p1 c0 c1)
   deleted: (at p1 l5) (capacity v4 c1)
   added: (in p1 v4) (capacity v4 c0)
   goals met: 4 of 14
22. (drive v4 l5 l3)
   deleted: (at v4 l5)
   added: (at v4 l3)
   goals met: 4 of 14
23. (drop v4 l3 p1 c0 c1)
   deleted: (in p1 v4) (capacity v4 c0)
   added: (at p1 l3) (capacity v4 c1)
   goals met: 5 of 14
24. (drive v4 l3 l1)
   deleted: (at v4 l3)
   added: (at v4 l1)
   goals met: 5 of 14
25. (pick-up v4 l1 p9 c0 c1)
   deleted: (at p9 l1) (capacity v4 c1)
   added: (in p9 v4) (capacity v4 c0)
   goals met: 5 of 14
26. (drive v4 l1 l3)
   deleted: (at v4 l1)
   added: (at v4 l3)
   goals met: 5 of 14
27. (drop v4 l3 p9 c0 c1)
   deleted: (in p9 v4) (capacity v4 c0)
   added: (at p9 l3) (capacity v4 c1)
   goals met: 6 of 14
28. (drive v2 l14 l1)
   deleted: (at v2 l14)
   added: (at v2 l1)
   goals met: 6 of 14
29. (pick-up v2 l1 p5 c0 c1)
   deleted: (at p5 l1) (capacity v2 c1)
   added: (in p5 v2) (capacity v2 c0)
   goals met: 6 of 14
30. (drive v4 l3 l10)
   deleted: (at v4 l3)
   added: (at v4 l10)
   goals met: 6 of 14
31. (drive v2 l1 l7)
   deleted: (at v2 l1)
   added: (at v2 l7)
   goals met: 6 of 14
32. (drive v4 l10 l14)
   deleted: (at v4 l10)
   added: (at v4 l14)
   goals met: 6 of 14
33. (drop v2 l7 p5 c0 c1)
   deleted: (in p5 v2) (capacity v2 c0)
   added: (at p5 l7) (capacity v2 c1)
   goals met: 7 of 14
34. (pick-up v4 l14 p14 c0 c1)
   deleted: (at p14 l14) (capacity v4 c1)
   added: (in p14 v4) (capacity v4 c0)
   goals met: 7 of 14
35. (drive v4 l14 l2)
   deleted: (at v4 l14)
   added: (at v4 l2)
   goals met: 7 of 14
36. (drop v4 l2 p14 c0 c1)
   deleted: (in p14 v4) (capacity v4 c0)
   added: (at p14 l2) (capacity v4 c1)
   goals met: 8 of 14
37. (drive v2 l7 l14)
   deleted: (at v2 l7)
   added: (at v2 l14)
   goals met: 8 of 14
38. (pick-up v2 l14 p10 c0 c1)
   deleted: (at p10 l14) (capacity v2 c1)
   added: (in p10 v2) (capacity v2 c0)
   goals met: 8 of 14
39. (drive v4 l2 l10)
   deleted: (at v4 l2)
   added: (at v4 l10)
   goals met: 8 of 14
40. (drive v2 l14 l6)
   deleted: (at v2 l14)
   added: (at v2 l6)
   goals met: 8 of 14
41. (drop v2 l6 p10 c0 c1)
   deleted: (in p10 v2) (capacity v2 c0)
   added: (at p10 l6) (capacity v2 c1)
   goals met: 9 of 14
42. (drive v4 l10 l9)
   deleted: (at v4 l10)
   added: (at v4 l9)
   goals met: 9 of 14
43. (pick-up v4 l9 p12 c0 c1)
   deleted: (at p12 l9) (capacity v4 c1)
   added: (in p12 v4) (capacity v4 c0)
   goals met: 9 of 14
44. (drive v4 l9 l7)
   deleted: (at v4 l9)
   added: (at v4 l7)
   goals met: 9 of 14
45. (drop v4 l7 p12 c0 c1)
   deleted: (in p12 v4) (capacity v4 c0)
   added: (at p12 l7) (capacity v4 c1)
   goals met: 10 of 14
46. (drive v2 l6 l4)
   deleted: (at v2 l6)
   added: (at v2 l4)
   goals met: 10 of 14
47. (pick-up v2 l4 p3 c0 c1)
   deleted: (at p3 l4) (capacity v2 c1)
   added: (in p3 v2) (capacity v2 c0)
   goals met: 10 of 14
48. (drive v4 l7 l10)
   deleted: (at v4 l7)
   added: (at v4 l10)
   goals met: 10 of 14
49. (drive v2 l4 l6)
   deleted: (at v2 l4)
   added: (at v2 l6)
   goals met: 10 of 14
50. (drop v2 l6 p3 c0 c1)
   deleted: (in p3 v2) (capacity v2 c0)
   added: (at p3 l6) (capacity v2 c1)
   goals met: 11 of 14
51. (drive v2 l6 l4)
   deleted: (at v2 l6)
   added: (at v2 l4)
   goals met: 11 of 14
52. (pick-up v2 l4 p7 c0 c1)
   deleted: (at p7 l4) (capacity v2 c1)
   added: (in p7 v2) (capacity v2 c0)
   goals met: 11 of 14
53. (drive v2 l4 l10)
   deleted: (at v2 l4)
   added: (at v2 l10)
   goals met: 11 of 14
54. (drop v2 l10 p7 c0 c1)
   deleted: (in p7 v2) (capacity v2 c0)
   added: (at p7 l10) (capacity v2 c1)
   goals met: 12 of 14
55. (drive v2 l10 l9)
   deleted: (at v2 l10)
   added: (at v2 l9)
   goals met: 12 of 14
56. (pick-up v2 l9 p8 c0 c1)
   deleted: (at p8 l9) (capacity v2 c1)
   added: (in p8 v2) (capacity v2 c0)
   goals met: 12 of 14
57. (drive v2 l9 l4)
   deleted: (at v2 l9)
   added: (at v2 l4)
   goals met: 12 of 14
58. (drop v2 l4 p8 c0 c1)
   deleted: (in p8 v2) (capacity v2 c0)
   added: (at p8 l4) (capacity v2 c1)
   goals met: 13 of 14
59. (drive v4 l10 l9)
   deleted: (at v4 l10)
   added: (at v4 l9)
   goals met: 13 of 14
60. (pick-up v4 l9 p4 c0 c1)
   deleted: (at p4 l9) (capacity v4 c1)
   added: (in p4 v4) (capacity v4 c0)
   goals met: 13 of 14
61. (drive v4 l9 l10)
   deleted: (at v4 l9)
   added: (at v4 l10)
   goals met: 13 of 14
62. (drop v4 l10 p4 c0 c1)
   deleted: (in p4 v4) (capacity v4 c0)
   added: (at p4 l10) (capacity v4 c1)
   goals met: 14 of 14
